{
  "AFB": [
    {
      "object": "",
      "owner": "",
      "tipo": "",
      "ownerGroup": "",
      "user": [
        "",
        ""
      ],
      "code": "",
      "servers": [
        ""
      ],
      "risk": "",
      "impact": "",
      "variable": [
        "service=\"\""
      ]
    }
  ],
  "ASISA": [
    {
      "object": "",
      "owner": "",
      "tipo": "",
      "ownerGroup": "",
      "user": [
        "",
        ""
      ],
      "code": "",
      "servers": [
        ""
      ],
      "risk": "",
      "impact": "",
      "variable": [
        "service=\"\""
      ]
    }
  ],
  "FT": [
    {
      "object": "PermitRootLogin",
      "owner": "Sistemas",
      "tipo": "/S/",
      "ownerGroup": "Group Sistemas",
      "user": [
        ""
      ],
      "code": "2-DOC",
      "servers": [
        "AOTLXPRSIO10002"
      ],
      "risk": "By restricting root login through ssh, a user is forced to use a regular, account to login, and perform su to gain root acces.  Root access is achieved by logging into a regular non-privileged userid, and then su To provide an audit trail.",
      "impact": "The configuration is required to perform server activities, for gpfs requirements it is mandatory to put it on the nodes of the cluster itself.",
      "variable": [
        "Para servidores CLUSTER, tiene PermitRootLogin a YES, con un Match Address a las IP del CLUSTER, puede ir conjunto con un PermitRootLogin a NO"
      ]
    }
  ],
  "INFRA": [
    {
      "object": "LDAP",
      "owner": "Sistemas",
      "tipo": "/S/",
      "ownerGroup": "Sistemas",
      "user": [
        "Sistemas"
      ],
      "code": "2-DOC",
      "servers": [
        "ES06QIH02IR01RM"
      ],
      "risk": "If we disable this SLAPD service, CACF automation framework won't be able to transfer files to endpoints since BDS service depends on this SLAPD service. CACF  is required to handle automation actions like compliance, inventory and patching among others. It's a mandatory requirement to check and apply compliance settings. If we disable it, we will not be able to follow security guidelines and wil impact in customer agreements.",
      "impact": "SLAPD is a service that exposes user information. Any device connected to the same network would be able to acces userid information. In order to avoid it, we've configured the service to listen only in localhost interface.",
      "variable": [
        ""
      ],
      "SO" : "Linux"
    }
  ],
  "LBK": [
    {
      "object": "",
      "owner": "",
      "tipo": "",
      "ownerGroup": "",
      "user": [
        "",
        ""
      ],
      "code": "",
      "servers": [
        ""
      ],
      "risk": "",
      "impact": "",
      "variable": [
        "service=\"\""
      ]
    }
  ]
}